In [93]:
import pandas as pd

In [94]:
df = pd.read_csv('/Users/maria/Documents/spiced/spiced_projects/week7/data/ECA_blended_custom/TG_STAID002759.txt', skiprows=19, skipinitialspace=True)

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53357 entries, 0 to 53356
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SOUID   53357 non-null  int64
 1   DATE    53357 non-null  int64
 2   TG      53357 non-null  int64
 3   Q_TG    53357 non-null  int64
dtypes: int64(4)
memory usage: 1.6 MB

In [96]:
df.describe()

               SOUID          DATE            TG          Q_TG
count   53357.000000  5.335700e+04  53357.000000  53357.000000
mean   119357.653541  1.948610e+07     57.050415      0.032910
std      8023.826001  4.217116e+05    614.099351      0.543108
min    111448.000000  1.876010e+07  -9999.000000      0.000000
25%    111448.000000  1.912071e+07     33.000000      0.000000
50%    111448.000000  1.949012e+07     94.000000      0.000000
75%    127488.000000  1.985072e+07    157.000000      0.000000
max    128124.000000  2.022013e+07    305.000000      9.000000

In [97]:
df.columns

Index(['SOUID', 'DATE', 'TG', 'Q_TG'], dtype='object')

In [98]:
df['Q_TG'].value_counts()

0    53161
9      195
1        1
Name: Q_TG, dtype: int64

In [99]:
df['SOUID'].value_counts()

111448    27060
127488    25933
128124      364
Name: SOUID, dtype: int64

In [100]:
df['DATE'] = df['DATE'].astype(str)

In [101]:
df.set_index(pd.to_datetime(df['DATE']), inplace= True)

In [102]:
df.drop(['DATE'], axis=1, inplace=True)

In [103]:
df.drop(['SOUID'], axis=1, inplace=True)

In [104]:
df

            TG  Q_TG
DATE
1876-01-01  22     0
1876-01-02  25     0
1876-01-03   3     0
1876-01-04 -58     0
1876-01-05 -98     0
...         ..   ...
2022-01-27  44     0
2022-01-28  49     0
2022-01-29  58     0
2022-01-30  58     0
2022-01-31  29     0

[53357 rows x 2 columns]

In [105]:
df['temp C'] = df['TG']*0.1

In [106]:
df.drop(['TG'], axis=1, inplace=True)

In [107]:
df

            Q_TG  temp C
DATE
1876-01-01     0     2.2
1876-01-02     0     2.5
1876-01-03     0     0.3
1876-01-04     0    -5.8
1876-01-05     0    -9.8
...          ...     ...
2022-01-27     0     4.4
2022-01-28     0     4.9
2022-01-29     0     5.8
2022-01-30     0     5.8
2022-01-31     0     2.9

[53357 rows x 2 columns]

In [119]:
missing_values = df[df['Q_TG']==9]
missing_values.value_counts()

Q_TG  temp C
9     -999.9    195
dtype: int64

In [113]:
missing_values.count()

Q_TG      195
temp C    195
dtype: int64

In [109]:
missing_values.index

DatetimeIndex(['1945-04-25', '1945-04-26', '1945-04-27', '1945-04-28',
               '1945-04-29', '1945-04-30', '1945-05-01', '1945-05-02',
               '1945-05-03', '1945-05-04',
               ...
               '1945-10-27', '1945-10-28', '1945-10-29', '1945-10-30',
               '1945-10-31', '1945-11-01', '1945-11-02', '1945-11-03',
               '1945-11-04', '1945-11-05'],
              dtype='datetime64[ns]', name='DATE', length=195, freq=None)

In [175]:
df.loc['1945-04-25', 'temp C']

-999.9000000000001

In [118]:
d0 = pd.to_datetime('1945-04-25')
d1 = pd.to_datetime('1945-11-06')
delta = d1 - d0
print(delta.days)

195

In [164]:
before = df.loc['1935-04-25':'1945-04-24']

In [165]:
after = df.loc['1945-11-06':'1955-11-05']

In [166]:
before = before.groupby([before.index.month, before.index.day]).mean()
before

           Q_TG    temp C
DATE DATE
1    1      0.0 -0.490909
     2      0.0 -0.081818
     3      0.0  0.490909
     4      0.0 -0.300000
     5      0.0 -1.763636
...         ...       ...
12   27     0.0 -1.827273
     28     0.0 -1.963636
     29     0.0 -1.927273
     30     0.0 -0.227273
     31     0.0  0.009091

[366 rows x 2 columns]

In [167]:
after = after.groupby([after.index.month, after.index.day]).mean()
after

           Q_TG  temp C
DATE DATE
1    1      0.0   -1.56
     2      0.0    0.14
     3      0.0    0.70
     4      0.0   -0.48
     5      0.0   -1.37
...         ...     ...
12   27     0.0    2.94
     28     0.0    2.75
     29     0.0    1.90
     30     0.0   -0.46
     31     0.0   -1.27

[366 rows x 2 columns]

In [171]:
before.xs(4, level=0)

      Q_TG     temp C
DATE
1      0.0   6.863636
2      0.0   7.218182
3      0.0   5.045455
4      0.0   5.600000
5      0.0   6.990909
6      0.0   6.236364
7      0.0   6.109091
8      0.0   5.836364
9      0.0   6.836364
10     0.0   8.300000
11     0.0   7.863636
12     0.0   8.209091
13     0.0   8.972727
14     0.0   9.518182
15     0.0   9.781818
16     0.0  10.318182
17     0.0  10.481818
18     0.0   9.236364
19     0.0   9.800000
20     0.0   9.809091
21     0.0   9.490909
22     0.0   9.390909
23     0.0   9.236364
24     0.0   9.518182
25     0.0   9.290909
26     0.0   9.290909
27     0.0   9.481818
28     0.0   9.854545
29     0.0   9.581818
30     0.0   9.854545

In [174]:
# .loc[(month,day),:]
before.loc[(5,29),:],after.loc[(5,29),:]

(Q_TG       0.0
 temp C    15.0
 Name: (5, 29), dtype: float64,
 Q_TG       0.00
 temp C    15.67
 Name: (5, 29), dtype: float64)

In [183]:
for date in missing_values.index:
    # df.loc[date,'temp C']
    df.loc[date,'temp C'] = round((before.loc[(date.month,date.day),'temp C']+ after.loc[(date.month,date.day),'temp C'])/2,1)

In [184]:
df

            Q_TG  temp C
DATE
1876-01-01     0     2.2
1876-01-02     0     2.5
1876-01-03     0     0.3
1876-01-04     0    -5.8
1876-01-05     0    -9.8
...          ...     ...
2022-01-27     0     4.4
2022-01-28     0     4.9
2022-01-29     0     5.8
2022-01-30     0     5.8
2022-01-31     0     2.9

[53357 rows x 2 columns]